-- 部门通知
-- 通知编号,通知时间,通知正文,科室来源
insert into his_notice 
(id, send_time, content, dept_id) values 
(1,'2021-04-30 03:27:46',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(2,'2021-05-01 15:12:32',"培训通知
一、培训时间
5月10—12号 16:00-17:40
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(3,'2021-05-02 15:53:58',"培训通知
一、培训时间
5月2号 16:00-17:35
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(4,'2021-05-03 22:16:59',"培训通知
一、培训时间
5月5—6号 16:00-17:35
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(5,'2021-05-04 04:20:55',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:11",13),
(6,'2021-05-05 05:33:49',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-9-12  14:00-16:04",13),
(7,'2021-05-06 21:59:34',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(8,'2021-05-07 21:51:45',"培训通知
一、培训时间
5月10—20号 14:00-17:33
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(9,'2021-05-08 12:37:35',"培训通知
一、培训时间
5月20—22号 16:00-17:30
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(10,'2021-05-09 05:31:13',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:09",13),
(11,'2021-05-10 07:59:06',"培训通知
一、培训时间
5月1—2号 16:00-17:36
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(12,'2021-05-11 10:04:47',"培训通知
一、培训时间
6月2—3号 16:00-17:40
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(13,'2021-05-12 06:32:31',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:13",13),
(14,'2021-05-13 08:54:11',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(15,'2021-05-14 01:42:16',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(16,'2021-05-15 20:34:29',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:06",13),
(17,'2021-05-16 20:13:41',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(18,'2021-05-17 19:34:49',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(19,'2021-05-18 07:03:29',"培训通知
一、培训时间
5月1—2号 16:00-17:37
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(20,'2021-05-19 20:48:56',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(21,'2021-05-20 22:50:13',"培训通知
一、培训时间
5月1—2号 16:00-17:34
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(22,'2021-05-21 17:56:45',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:01",13),
(23,'2021-05-22 15:01:19',"培训通知
一、培训时间
5月1—2号 16:00-17:37
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(24,'2021-05-23 19:13:01',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:14",13),
(25,'2021-05-24 06:24:31',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:00",13),
(26,'2021-05-25 02:35:11',"培训通知
一、培训时间
5月1—2号 16:00-17:36
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(27,'2021-05-26 07:36:57',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:02",13),
(28,'2021-05-27 09:14:21',"培训通知
一、培训时间
5月1—2号 16:00-17:39
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(29,'2021-05-28 16:55:36',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:12",13),
(30,'2021-05-29 12:22:09',"培训通知
一、培训时间
5月1—2号 16:00-17:32
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(31,'2021-05-30 03:34:40',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(32,'2021-05-31 03:16:53',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:07",13),
(33,'2021-06-01 01:15:44',"培训通知
一、培训时间
5月1—2号 16:00-17:32
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(34,'2021-06-02 19:04:12',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:00",13),
(35,'2021-06-03 20:14:49',"培训通知
一、培训时间
5月1—2号 16:00-17:34
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(36,'2021-06-04 04:16:50',"培训通知
一、培训时间
5月1—2号 16:00-17:38
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(37,'2021-06-05 05:11:22',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13),
(38,'2021-06-06 16:35:38',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:08",13),
(39,'2021-06-07 04:15:28',"培训通知
一、培训时间
5月1—2号 16:00-17:33
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(40,'2021-06-08 11:19:36',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:10",13),
(41,'2021-06-09 20:19:42',"培训通知
一、培训时间
5月1—2号 16:00-17:30
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(42,'2021-06-10 14:32:47',"培训通知
一、培训时间
5月1—2号 16:00-17:38
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(43,'2021-06-11 10:00:51',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:03",13),
(44,'2021-06-12 20:15:54',"培训通知
一、培训时间
5月1—2号 16:00-17:41
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(45,'2021-06-13 09:18:02',"培训通知
一、培训时间
5月1—2号 16:00-17:31
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(46,'2021-06-14 17:12:40',"考试通知
各科室：
为进一步提高全院专业技术人员业务水平，有效防范医疗纠纷的发生，按照年初制定的工作计划，准备对全院医师进行急救知识考试，现将相关事宜通知如下。
一、 考核内容  急救理论知识
复习题放在医务科共享里，70%考试题来源复习题，希望各医师认真准备。
二、考试人员  各科室主治医师和住院医师（ 值班人员参加第二轮考试），任何人不得缺席。
朱元琛负责阅卷  李国铭负责监考
三、考试办法  闭卷考试 七楼会议室
四、时间安排  2021-7-4  14:00-16:05",13),
(47,'2021-06-15 07:10:34',"培训通知
一、培训时间
5月1—2号 16:00-17:39
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(48,'2021-06-16 08:05:37',"培训通知
一、培训时间
5月1—2号 16:00-17:30
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(49,'2021-06-17 17:52:43',"培训通知
一、培训时间
5月1—2号 16:00-17:31
二、培训地点  多媒体小会议室
三、培训内容  急诊收治政策和管理知识
四、参加人员  全体中层干部
HIS科教科",13),
(50,'2021-06-18 09:20:42',"关于成立医院学术委员会的通知 
医院各科室（单位）：
为了加强我院学术管理工作，提高院内业务建设、科研立项、开展新技术、新项目等重大决策的科学性的、民主性的、权威性的，以及开展新项目、新技术和科研项目的可行性、安全性、实用性和社会效益与经济效益。推进医、教、研的全面发展，同时监督和管理全院医疗工作的质量，经研究决定成立学术委员会，学术委员会下设内科、外科和护理三个专业小组，具体内容见规范性文件。",13);

-- 知会编号, 通知编号, 知会科室
insert into his_notice_target_dept 
(id, notice_id, department_id) values 
    (1, 1, 1),
    (2, 1, 2),
    (3, 1, 3),
    (4, 1, 4),
    (5, 1, 5),
    (6, 1, 6),
    (7, 1, 7),
    (8, 1, 8),
    (9, 1, 9),
    (10, 2, 1),
    (11, 2, 2),
    (12, 2, 3),
    (13, 2, 4),
    (14, 2, 5),
    (15, 2, 6),
    (16, 2, 7),
    (17, 2, 8),
    (18, 2, 9),
    (19, 3, 1),
    (20, 3, 2),
    (21, 3, 3),
    (22, 3, 4),
    (23, 3, 5),
    (24, 3, 6),
    (25, 3, 7),
    (26, 3, 8),
    (27, 3, 9),
    (28, 4, 1),
    (29, 4, 2),
    (30, 4, 3),
    (31, 4, 4),
    (32, 4, 5),
    (33, 4, 6),
    (34, 4, 7),
    (35, 4, 8),
    (36, 4, 9),
    (37, 5, 1),
    (38, 5, 2),
    (39, 5, 3),
    (40, 5, 4),
    (41, 5, 5),
    (42, 5, 6),
    (43, 5, 7),
    (44, 5, 8),
    (45, 5, 9),
    (46, 6, 1),
    (47, 6, 2),
    (48, 6, 3),
    (49, 6, 4),
    (50, 6, 5),
    (51, 6, 6),
    (52, 6, 7),
    (53, 6, 8),
    (54, 6, 9),
    (55, 7, 1),
    (56, 7, 2),
    (57, 7, 3),
    (58, 7, 4),
    (59, 7, 5),
    (60, 7, 6),
    (61, 7, 7),
    (62, 7, 8),
    (63, 7, 9),
    (64, 8, 1),
    (65, 8, 2),
    (66, 8, 3),
    (67, 8, 4),
    (68, 8, 5),
    (69, 8, 6),
    (70, 8, 7),
    (71, 8, 8),
    (72, 8, 9),
    (73, 9, 1),
    (74, 9, 2),
    (75, 9, 3),
    (76, 9, 4),
    (77, 9, 5),
    (78, 9, 6),
    (79, 9, 7),
    (80, 9, 8),
    (81, 9, 9),
    (82, 10, 1),
    (83, 10, 2),
    (84, 10, 3),
    (85, 10, 4),
    (86, 10, 5),
    (87, 10, 6),
    (88, 10, 7),
    (89, 10, 8),
    (90, 10, 9),
    (91, 11, 1),
    (92, 11, 2),
    (93, 11, 3),
    (94, 11, 4),
    (95, 11, 5),
    (96, 11, 6),
    (97, 11, 7),
    (98, 11, 8),
    (99, 11, 9),
    (100, 12, 1),
    (101, 12, 2),
    (102, 12, 3),
    (103, 12, 4),
    (104, 12, 5),
    (105, 12, 6),
    (106, 12, 7),
    (107, 12, 8),
    (108, 12, 9),
    (109, 13, 1),
    (110, 13, 2),
    (111, 13, 3),
    (112, 13, 4),
    (113, 13, 5),
    (114, 13, 6),
    (115, 13, 7),
    (116, 13, 8),
    (117, 13, 9),
    (118, 14, 1),
    (119, 14, 2),
    (120, 14, 3),
    (121, 14, 4),
    (122, 14, 5),
    (123, 14, 6),
    (124, 14, 7),
    (125, 14, 8),
    (126, 14, 9),
    (127, 15, 1),
    (128, 15, 2),
    (129, 15, 3),
    (130, 15, 4),
    (131, 15, 5),
    (132, 15, 6),
    (133, 15, 7),
    (134, 15, 8),
    (135, 15, 9),
    (136, 16, 1),
    (137, 16, 2),
    (138, 16, 3),
    (139, 16, 4),
    (140, 16, 5),
    (141, 16, 6),
    (142, 16, 7),
    (143, 16, 8),
    (144, 16, 9),
    (145, 17, 1),
    (146, 17, 2),
    (147, 17, 3),
    (148, 17, 4),
    (149, 17, 5),
    (150, 17, 6),
    (151, 17, 7),
    (152, 17, 8),
    (153, 17, 9),
    (154, 18, 1),
    (155, 18, 2),
    (156, 18, 3),
    (157, 18, 4),
    (158, 18, 5),
    (159, 18, 6),
    (160, 18, 7),
    (161, 18, 8),
    (162, 18, 9),
    (163, 19, 1),
    (164, 19, 2),
    (165, 19, 3),
    (166, 19, 4),
    (167, 19, 5),
    (168, 19, 6),
    (169, 19, 7),
    (170, 19, 8),
    (171, 19, 9),
    (172, 20, 1),
    (173, 20, 2),
    (174, 20, 3),
    (175, 20, 4),
    (176, 20, 5),
    (177, 20, 6),
    (178, 20, 7),
    (179, 20, 8),
    (180, 20, 9),
    (181, 21, 1),
    (182, 21, 2),
    (183, 21, 3),
    (184, 21, 4),
    (185, 21, 5),
    (186, 21, 6),
    (187, 21, 7),
    (188, 21, 8),
    (189, 21, 9),
    (190, 22, 1),
    (191, 22, 2),
    (192, 22, 3),
    (193, 22, 4),
    (194, 22, 5),
    (195, 22, 6),
    (196, 22, 7),
    (197, 22, 8),
    (198, 22, 9),
    (199, 23, 1),
    (200, 23, 2),
    (201, 23, 3),
    (202, 23, 4),
    (203, 23, 5),
    (204, 23, 6),
    (205, 23, 7),
    (206, 23, 8),
    (207, 23, 9),
    (208, 24, 1),
    (209, 24, 2),
    (210, 24, 3),
    (211, 24, 4),
    (212, 24, 5),
    (213, 24, 6),
    (214, 24, 7),
    (215, 24, 8),
    (216, 24, 9),
    (217, 25, 1),
    (218, 25, 2),
    (219, 25, 3),
    (220, 25, 4),
    (221, 25, 5),
    (222, 25, 6),
    (223, 25, 7),
    (224, 25, 8),
    (225, 25, 9),
    (226, 26, 1),
    (227, 26, 2),
    (228, 26, 3),
    (229, 26, 4),
    (230, 26, 5),
    (231, 26, 6),
    (232, 26, 7),
    (233, 26, 8),
    (234, 26, 9),
    (235, 27, 1),
    (236, 27, 2),
    (237, 27, 3),
    (238, 27, 4),
    (239, 27, 5),
    (240, 27, 6),
    (241, 27, 7),
    (242, 27, 8),
    (243, 27, 9),
    (244, 28, 1),
    (245, 28, 2),
    (246, 28, 3),
    (247, 28, 4),
    (248, 28, 5),
    (249, 28, 6),
    (250, 28, 7),
    (251, 28, 8),
    (252, 28, 9),
    (253, 29, 1),
    (254, 29, 2),
    (255, 29, 3),
    (256, 29, 4),
    (257, 29, 5),
    (258, 29, 6),
    (259, 29, 7),
    (260, 29, 8),
    (261, 29, 9),
    (262, 30, 1),
    (263, 30, 2),
    (264, 30, 3),
    (265, 30, 4),
    (266, 30, 5),
    (267, 30, 6),
    (268, 30, 7),
    (269, 30, 8),
    (270, 30, 9),
    (271, 31, 1),
    (272, 31, 2),
    (273, 31, 3),
    (274, 31, 4),
    (275, 31, 5),
    (276, 31, 6),
    (277, 31, 7),
    (278, 31, 8),
    (279, 31, 9),
    (280, 32, 1),
    (281, 32, 2),
    (282, 32, 3),
    (283, 32, 4),
    (284, 32, 5),
    (285, 32, 6),
    (286, 32, 7),
    (287, 32, 8),
    (288, 32, 9),
    (289, 33, 1),
    (290, 33, 2),
    (291, 33, 3),
    (292, 33, 4),
    (293, 33, 5),
    (294, 33, 6),
    (295, 33, 7),
    (296, 33, 8),
    (297, 33, 9),
    (298, 34, 1),
    (299, 34, 2),
    (300, 34, 3),
    (301, 34, 4),
    (302, 34, 5),
    (303, 34, 6),
    (304, 34, 7),
    (305, 34, 8),
    (306, 34, 9),
    (307, 35, 1),
    (308, 35, 2),
    (309, 35, 3),
    (310, 35, 4),
    (311, 35, 5),
    (312, 35, 6),
    (313, 35, 7),
    (314, 35, 8),
    (315, 35, 9),
    (316, 36, 1),
    (317, 36, 2),
    (318, 36, 3),
    (319, 36, 4),
    (320, 36, 5),
    (321, 36, 6),
    (322, 36, 7),
    (323, 36, 8),
    (324, 36, 9),
    (325, 37, 1),
    (326, 37, 2),
    (327, 37, 3),
    (328, 37, 4),
    (329, 37, 5),
    (330, 37, 6),
    (331, 37, 7),
    (332, 37, 8),
    (333, 37, 9),
    (334, 38, 1),
    (335, 38, 2),
    (336, 38, 3),
    (337, 38, 4),
    (338, 38, 5),
    (339, 38, 6),
    (340, 38, 7),
    (341, 38, 8),
    (342, 38, 9),
    (343, 39, 1),
    (344, 39, 2),
    (345, 39, 3),
    (346, 39, 4),
    (347, 39, 5),
    (348, 39, 6),
    (349, 39, 7),
    (350, 39, 8),
    (351, 39, 9),
    (352, 40, 1),
    (353, 40, 2),
    (354, 40, 3),
    (355, 40, 4),
    (356, 40, 5),
    (357, 40, 6),
    (358, 40, 7),
    (359, 40, 8),
    (360, 40, 9),
    (361, 41, 1),
    (362, 41, 2),
    (363, 41, 3),
    (364, 41, 4),
    (365, 41, 5),
    (366, 41, 6),
    (367, 41, 7),
    (368, 41, 8),
    (369, 41, 9),
    (370, 42, 1),
    (371, 42, 2),
    (372, 42, 3),
    (373, 42, 4),
    (374, 42, 5),
    (375, 42, 6),
    (376, 42, 7),
    (377, 42, 8),
    (378, 42, 9),
    (379, 43, 1),
    (380, 43, 2),
    (381, 43, 3),
    (382, 43, 4),
    (383, 43, 5),
    (384, 43, 6),
    (385, 43, 7),
    (386, 43, 8),
    (387, 43, 9),
    (388, 44, 1),
    (389, 44, 2),
    (390, 44, 3),
    (391, 44, 4),
    (392, 44, 5),
    (393, 44, 6),
    (394, 44, 7),
    (395, 44, 8),
    (396, 44, 9),
    (397, 45, 1),
    (398, 45, 2),
    (399, 45, 3),
    (400, 45, 4),
    (401, 45, 5),
    (402, 45, 6),
    (403, 45, 7),
    (404, 45, 8),
    (405, 45, 9),
    (406, 46, 1),
    (407, 46, 2),
    (408, 46, 3),
    (409, 46, 4),
    (410, 46, 5),
    (411, 46, 6),
    (412, 46, 7),
    (413, 46, 8),
    (414, 46, 9),
    (415, 47, 1),
    (416, 47, 2),
    (417, 47, 3),
    (418, 47, 4),
    (419, 47, 5),
    (420, 47, 6),
    (421, 47, 7),
    (422, 47, 8),
    (423, 47, 9),
    (424, 48, 1),
    (425, 48, 2),
    (426, 48, 3),
    (427, 48, 4),
    (428, 48, 5),
    (429, 48, 6),
    (430, 48, 7),
    (431, 48, 8),
    (432, 48, 9),
    (433, 49, 1),
    (434, 49, 2),
    (435, 49, 3),
    (436, 49, 4),
    (437, 49, 5),
    (438, 49, 6),
    (439, 49, 7),
    (440, 49, 8),
    (441, 49, 9),
    (442, 50, 1),
    (443, 50, 2),
    (444, 50, 3),
    (445, 50, 4),
    (446, 50, 5),
    (447, 50, 6),
    (448, 50, 7),
    (449, 50, 8),
    (450, 50, 9);

-- 
