-- SQLite
insert into laboratory_testitemtype values (1,'临床检查'),(2,'生物化学'),(3,'微生物学'),(4,'寄生虫学'),(5,'风湿免疫');
insert into his_inpatientarea values ('A'), ('B'), ('C');
insert into rbac_usergroup values 
    (1, '内科', '2021-05-10 11:12:59'),(2, '外科', '2021-05-10 11:12:59'),
    (3, '儿科', '2021-05-10 11:12:59'),(4, '妇科', '2021-05-10 11:12:59'),
    (5, '眼科', '2021-05-10 11:12:59'),(6, '耳鼻喉科', '2021-05-10 11:12:59'),
    (7, '口腔科', '2021-05-10 11:12:59'),(8, '皮肤科', '2021-05-10 11:12:59'),
    (9, '急诊科', '2021-05-10 11:12:59'),(10, '检验科', '2021-05-10 11:12:59'),
    (11, '药房', '2021-05-10 11:12:59'),(12, '财务', '2021-05-10 11:12:59'),
    (13, '信息部', '2021-05-10 11:12:59');
insert into his_hospitaltitle values (1, '住院医师'),(2, '主治医师'),(3, '副主任医师'),(4, '主任医师');
insert into his_jobtype values (1, '医生'),(2, '护士'),(3, '药房医生'),(4, '检验医生'),(5, '财务'),(6, '运维');
commit;
